<a href="https://colab.research.google.com/github/adigenova/uohdb/blob/main/code/SQL_II_chinook_db.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Working with the Chinook database

## downloading the database from github

In [1]:
#download the Chinook database
!git clone https://github.com/lerocha/chinook-database.git

Cloning into 'chinook-database'...
remote: Enumerating objects: 1960, done.
remote: Counting objects: 100% (75/75), done.
remote: Compressing objects: 100% (54/54), done.
remote: Total 1960 (delta 33), reused 50 (delta 21), pack-reused 1885
Receiving objects: 100% (1960/1960), 19.57 MiB | 8.94 MiB/s, done.
Resolving deltas: 100% (1277/1277), done.

In [2]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql
# now we can use the magic extension to connect to our SQLite DB
# use %sql to write an inline SQL command
# use %%sql to write SQL commands in a cell
%sql sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite

'Connected: @/content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite'


### Display tables of the Chinook database

In [3]:
%%sql
SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('Album',),
 ('Artist',),
 ('Customer',),
 ('Employee',),
 ('Genre',),
 ('Invoice',),
 ('InvoiceLine',),
 ('MediaType',),
 ('Playlist',),
 ('PlaylistTrack',),
 ('Track',)]

getting information about a particular table

In [4]:
%%sql 
PRAGMA table_info([Artist]);

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(0, 'ArtistId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(120)', 0, None, 0)]

getting the SQL code that generate a table


## Create automatic documentation with [schemaspy](https://schemaspy.org/)

<img src="https://schemaspy.org/sample/diagrams/summary/relationships.real.large.png" alt="ER Diagram" width="836" height="605" />


In the above ER diagram, the tiny vertical key icon indicates a column is a primary key. A primary key is a column (or set of columns) whose values uniquely identify every row in a table. For example, `Employeeud` is the primary key in the `Employee` table.

The relationship icon indicates a foreign key constraint and a one-to-many relationship.

# SQL con Chinook

In [5]:
#contamos el numero de canciones en la base de datos
%%sql 
select COUNT(TrackID) as cnt from Track;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(3503,)]

In [19]:
# contamos el numero de canciones promedio por lista
%%sql
select COUNT(DISTINCT PlaylistId) as cnt from PlaylistTrack;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(14,)]

In [28]:
%%sql
select PlaylistId,COUNT(TrackId) as cnt from  PlaylistTrack GROUP BY PlaylistId;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(1, 3290),
 (3, 213),
 (5, 1477),
 (8, 3290),
 (9, 1),
 (10, 213),
 (11, 39),
 (12, 75),
 (13, 25),
 (14, 25),
 (15, 25),
 (16, 15),
 (17, 26),
 (18, 1)]

In [31]:
%%sql
select PlaylistId,COUNT(TrackId) as cnt 
from  PlaylistTrack
GROUP BY PlaylistId 
HAVING cnt > 100;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[(1, 3290), (3, 213), (5, 1477), (8, 3290), (10, 213)]

In [36]:
%%sql
select Name, Title as album_name 
from album as al, Artist as a 
where al.Artistid = a.Artistid limit 10;

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('AC/DC', 'For Those About To Rock We Salute You'),
 ('Accept', 'Balls to the Wall'),
 ('Accept', 'Restless and Wild'),
 ('AC/DC', 'Let There Be Rock'),
 ('Aerosmith', 'Big Ones'),
 ('Alanis Morissette', 'Jagged Little Pill'),
 ('Alice In Chains', 'Facelift'),
 ('Antônio Carlos Jobim', 'Warner 25 Anos'),
 ('Apocalyptica', 'Plays Metallica By Four Cellos'),
 ('Audioslave', 'Audioslave')]

In [37]:
%%sql
select Name, Title as album_name 
from album as al, Artist as a 
where al.Artistid = a.Artistid and a.Name = "AC/DC";

 * sqlite:////content/chinook-database/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite
Done.

[('AC/DC', 'For Those About To Rock We Salute You'),
 ('AC/DC', 'Let There Be Rock')]